For data science solutions, we most commonly rely on CSV, Excel spreadsheet, HTML, JSON, SQL, or other primitive data types and file formats.

In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\fazek\\OneDrive\\projects\\Python for Data Science and ML Bootcamp (Udemy)\\02 - Pandas'

In [4]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Note: Pandas can read from a plathera of sources, even from the **clipboard**!

In [6]:
df = pd.read_csv('example.csv')

In [7]:
df.to_csv('My_output', index=False) #if the index=False is not provided, a new column named "Unnamemed:0" will be created with the index values

Pandas can read excel spreadsheets, but cannot read the formulas in there

To read from excel, make sure you have `conda install xlrd` or `pip install xlrd`

Pandas thinks each sheet in an excel file is a dataframe.

In [9]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

When reading from html, Pandas is reading the specified html page and is looking for `table` elements, reading their content into a list.

This is basically web scraping.

In [12]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')

In [15]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [16]:
from sqlalchemy import create_engine

In [22]:
engine = create_engine('sqlite:///:memory:') #creating an in-memory db on the fly

In [25]:
df.to_sql('my_table', engine)

In [26]:
sqldf = pd.read_sql('my_table', con=engine)

In [27]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15